In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as stat

In [19]:
df = pd.read_json('\\Users\\Trocados\\DataAnalytics\\Estastitica\\enem_2023.json')

In [16]:
df.head()

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação,Sexo
0,585.669300,686.512178,390.482473,452.281333,546.371706,Homem
1,359.384608,642.084134,NaN,412.205207,741.825256,Mulher
2,622.732384,495.510719,443.183580,669.683401,684.515750,Homem
3,350.164605,602.041588,413.979810,676.608952,671.237114,Homem
4,384.093657,489.249140,609.758123,520.426698,744.375048,Homem

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Linguagens            897 non-null    float64
 1   Ciências humanas      936 non-null    float64
 2   Ciências da natureza  824 non-null    float64
 3   Matemática            924 non-null    float64
 4   Redação               860 non-null    float64
 5   Sexo                  1000 non-null   object
dtypes: float64(5), object(1)
memory usage: 54.7+ KB

In [21]:
df.mode()

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação,Sexo
0,287.0,289.9,314.4,319.8,270.839965,Homem
1,NaN,NaN,NaN,NaN,290.308608,NaN
2,NaN,NaN,NaN,NaN,324.222553,NaN
3,NaN,NaN,NaN,NaN,343.898504,NaN
4,NaN,NaN,NaN,NaN,347.897227,NaN
...,...,...,...,...,...,...
855,NaN,NaN,NaN,NaN,928.835434,NaN
856,NaN,NaN,NaN,NaN,929.654524,NaN
857,NaN,NaN,NaN,NaN,931.305275,NaN
858,NaN,NaN,NaN,NaN,981.016553,NaN
859,NaN,NaN,NaN,NaN,1000.000000,NaN

In [24]:
df.iloc[:, :5]

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação
0,585.669300,686.512178,390.482473,452.281333,546.371706
1,359.384608,642.084134,NaN,412.205207,741.825256
2,622.732384,495.510719,443.183580,669.683401,684.515750
3,350.164605,602.041588,413.979810,676.608952,671.237114
4,384.093657,489.249140,609.758123,520.426698,744.375048
...,...,...,...,...,...
995,455.479216,557.756326,511.347833,510.358766,NaN
996,457.755594,444.616952,542.028624,419.689692,715.984249
997,551.173161,568.769704,508.034658,NaN,798.408655
998,495.804002,522.125008,414.167228,451.696456,593.392939
999,435.332469,425.941701,NaN,466.003345,559.382918

In [25]:
df.iloc[:, :5].mode()

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação
0,287.0,289.9,314.4,319.8,270.839965
1,NaN,NaN,NaN,NaN,290.308608
2,NaN,NaN,NaN,NaN,324.222553
3,NaN,NaN,NaN,NaN,343.898504
4,NaN,NaN,NaN,NaN,347.897227
...,...,...,...,...,...
855,NaN,NaN,NaN,NaN,928.835434
856,NaN,NaN,NaN,NaN,929.654524
857,NaN,NaN,NaN,NaN,931.305275
858,NaN,NaN,NaN,NaN,981.016553
859,NaN,NaN,NaN,NaN,1000.000000

### MÉDIA E MEDIADA SOMENTE PARA VARIÁVEIS NÚMERICAS

In [26]:
df[['Linguagens','Ciências humanas', 'Ciências da natureza', 'Matemática', 'Redação' ]].mean()

Linguagens              514.524809
Ciências humanas        527.042281
Ciências da natureza    499.315583
Matemática              535.965660
Redação                 637.783532
dtype: float64

In [27]:
df[['Linguagens','Ciências humanas', 'Ciências da natureza', 'Matemática', 'Redação' ]].median()

Linguagens              515.045250
Ciências humanas        524.519920
Ciências da natureza    500.479263
Matemática              533.247767
Redação                 635.273973
dtype: float64

In [28]:
df.describe()

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação
count,897.000000,936.000000,824.000000,924.000000,860.000000
mean,514.524809,527.042281,499.315583,535.965660,637.783532
std,84.009313,77.811519,78.760404,86.648100,115.339972
min,287.000000,289.900000,314.400000,319.800000,270.839965
25%,458.360558,475.424546,444.709076,479.172971,556.468366
50%,515.045250,524.519920,500.479263,533.247767,635.273973
75%,571.635876,581.401952,548.751678,592.912963,715.989868
max,804.456317,763.919695,802.004568,807.877902,1000.000000

### Amplitude, desvio padrão e variância

In [30]:
def describe_new(df):
    df1 = df.describe()
    df1.loc["amplitude"] = df1.loc['max'] - df1.loc['min']
    df1.loc["variancia"] = df1.loc['std'] * df1.loc['std']
    return df1

In [31]:
describe_new(df)

,Linguagens,Ciências humanas,Ciências da natureza,Matemática,Redação
count,897.000000,936.000000,824.000000,924.000000,860.000000
mean,514.524809,527.042281,499.315583,535.965660,637.783532
std,84.009313,77.811519,78.760404,86.648100,115.339972
min,287.000000,289.900000,314.400000,319.800000,270.839965
25%,458.360558,475.424546,444.709076,479.172971,556.468366
50%,515.045250,524.519920,500.479263,533.247767,635.273973
75%,571.635876,581.401952,548.751678,592.912963,715.989868
max,804.456317,763.919695,802.004568,807.877902,1000.000000
amplitude,517.456317,474.019695,487.604568,488.077902,729.160035
variancia,7057.564698,6054.632515,6203.201190,7507.893239,13303.309244